#+title: Nore Emacs: Org *scratch*
#+author: composer
#+startup: entitiespretty
#+latex_compiler: xelatex
#+latex_header: \usepackage{listings}
#+latex_header: \usepackage{fontspec}
#+latex_header: \usepackage{xunicode}
#+latex_header: \usepackage{xltxtra}
#+latex_header: \usepackage{xeCJK}
#+latex_header: \usepackage[utf8x]{inputenc}


* scratch
	:PROPERTIES:
	:CUSTOM_ID: scratch
	:END:
	
** LaTeX
	 :PROPERTIES:
	 :CUSTOM_ID: latex
	 :END:
	 
Another way to notate \({\LaTeX}\).

** Quote
	 :PROPERTIES:
	 :CUSTOM_ID: quote
	 :END:
	 
#+BEGIN_QUOTE
Everything should be made as simple as possible,
but not any simpler. -- Albert Einstein
#+END_QUOTE

#+BEGIN_QUOTE
"I have a realistic grasp of my own strengths and weaknesses. My mind
is my weapon. My brother has his sword, King Robert has his warhammer,
and I have my mind … and a mind needs books as a sword needs a
whetstone, if it is to keep its edge." -- George R. R. Martin. "A Game
Of Thrones."
#+END_QUOTE

** Style
	 :PROPERTIES:
	 :CUSTOM_ID: style
	 :END:

The quick /brown/ *fox* =jumps= +over+ the lazy *dog*.
	 
** Align
	 :PROPERTIES:
	 :CUSTOM_ID: align
	 :END:

#+BEGIN_LEFT
Everything should be made as simple as possible,\\
but not any simpler.
#+END_LEFT

#+BEGIN_CENTER
Everything should be made as simple as possible,\\
but not any simpler.
#+END_CENTER

** Example
	 :PROPERTIES:
	 :CUSTOM_ID: example
	 :END:

#+BEGIN_EXAMPLE
some text here monospace
#+END_EXAMPLE

** Table 
	 :PROPERTIES:
	 :CUSTOM_ID: table
	 :END:
	 
Row formula:
| Student  | Maths | Physics | Mean |
|----------+-------+---------+------|
| Bertrand |    13 |      09 |   11 |
| Henri    |    15 |      14 |      |
| Arnold   |    17 |      13 |      |
#+TBLFM: @2$4=vmean($2..$3)

Column formula:
| Student  | Maths | Physics | Mean |
|----------+-------+---------+------|
| Bertrand |    13 |      09 |   11 |
| Henri    |    15 |      14 | 14.5 |
| Arnold   |    17 |      13 |   15 |
#+TBLFM: $4=vmean($2..$3)

Row and Column formula:
| Student  | Maths | Physics | Mean | Sum |
|----------+-------+---------+------+-----|
| Bertrand |    13 |      09 |   11 |  22 |
| Henri    |    15 |      14 | 14.5 |  29 |
| Arnold   |    17 |      13 |   15 |  30 |
|----------+-------+---------+------+-----|
| Means    |    15 |      12 | 13.5 |     |
| Sum      |    45 |      36 |      |  81 |
#+TBLFM: $2=vsum(@2$2..@4$2)::$3=vsum(@2$3..@4$3)::$4=vmean($2..$3)::$5=vsum($2..$3)::@5$2=vmean(@2$2..@4$2)::@5$3=vmean(@2$3..@4$3)

** Code
	:PROPERTIES:
	:CUSTOM_ID: code
	:END:

*** Elisp
	 :PROPERTIES:
	 :CUSTOM_ID: elisp
	 :END:

#+BEGIN_SRC emacs-lisp
(emacs-home*)
#+END_SRC

#+RESULTS:
: /Users/junjie/.emacs.d/

*** C
	 :PROPERTIES:
	 :CUSTOM_ID: c
	 :END:

#+BEGIN_SRC C :includes <stdio.h>
	int a = 1, b = 2;
	printf("%i + %i = %i\n", a, b, a+b);
#+END_SRC

#+RESULTS:
: 1 + 2 = 3

#+BEGIN_SRC C :includes <stdio.h> :main no :flags -O2
	int
	fibo(int n, int p, int acc)
	{
		if (0 == n)
			{
				return acc;
			}
		return fibo(n-1, acc, p+acc);
	}

	int main(void)
	{
		for (int i = 0; i < 10; i++)
			{
				int f = fibo(i, 0, 1);
				printf("fibo(%01i) = %04i\n", i, f);
			}
		return 0;
	}
#+END_SRC

#+RESULTS:
| fibo(0) | = | 0001 |
| fibo(1) | = | 0001 |
| fibo(2) | = | 0002 |
| fibo(3) | = | 0003 |
| fibo(4) | = | 0005 |
| fibo(5) | = | 0008 |
| fibo(6) | = | 0013 |
| fibo(7) | = | 0021 |
| fibo(8) | = | 0034 |
| fibo(9) | = | 0055 |

#+BEGIN_SRC C :includes <stdio.h> :main no :var from = "abcdefghijklmnopqrstuvwxyz"
	void
	send(char *to, char *from, int count) {
		int n = (count + 7) / 8;  /* count > 0 assumed */
		switch (count % 8) {
		case 0:    do { *to++ = *from++; 
		case 7:         *to++ = *from++;
		case 6:         *to++ = *from++;
		case 5:         *to++ = *from++;
		case 4:         *to++ = *from++;
		case 3:         *to++ = *from++;
		case 2:         *to++ = *from++;
		case 1:         *to++ = *from++;
							 } while (--n > 0);
		}
	}

	int
	main(void)
	{
		/* char *from = "abcdefghijklmnopqrstuvwxyz"; */
		char to[32] = {0};
		send(to, from, 11);
		printf("to = %s\n", to);

		return 0;
	}

#+END_SRC

#+RESULTS:
: to = abcdefghijk

** Math

*** Symbol

**** Greek Characters

#+NAME: Greek
| name       | character   | name     | character | name   | character |
|------------+-------------+----------+-----------+--------+-----------|
| Gamma      | \(\Gamma\)       | Delta    | \(\Delta\)     | Theta  | \(\Theta\)     |
| Lambda     | \(\Lambda\)       | Xi       | \(\Xi\)     | Pi     | \(\Pi\)     |
| Sigma      | \(\Sigma\)       | Upsilon  | \(\Upsilon\)     | Phi    | \(\Phi\)     |
| Psi        | \(\Psi\)       | Omega    | \(\Omega\)     |        |           |
|------------+-------------+----------+-----------+--------+-----------|
| alpha      | \(\alpha\)       | beta     | \(\beta\)     | gamma  | \(\gamma\)     |
| delta      | \(\delta\)       | epsilon  | \(\epsilon\)     | zeta   | \(\zeta\)     |
| eta        | \(\eta\)       | theta    | \(\theta\)     | iota   | \(\iota\)     |
| kappa      | \(\kappa\)       | lambda   | \(\lambda\)     | mu     | \(\mu\)     |
| nu         | \(\nu\)       | xi       | \(\xi\)     | pi     | \(\pi\)     |
| rho        | \(\rho\)       | sigma    | \(\sigma\)     | tau    | \(\tau\)     |
| upsilon    | \(\upsilon\)       | phi      | \(\phi\)     | chi    | \(\chi\)     |
| psi        | \(\psi\)       | omega    | \(\omega\)     |        |           |
|------------+-------------+----------+-----------+--------+-----------|
| varepsilon | \(\varepsilon\)       | vartheta | \(\vartheta\)     | varpi  | \(\varpi\)     |
| varrho     | \(\varrho\) | varsigma | \(\varsigma\)     | varphi | \(\varphi\)     |
|            |             |          |           |        |           |

**** Operators

#+NAME: Operator
| name     | character     | name      | character | name       | character     |
|----------+---------------+-----------+-----------+------------+---------------|
| cdot     | \(\cdot\)         | times     | \(\times\)     | ast        | \(\ast\)         |
| div      | \(\div\)         | diamond   | \(\diamond\)     | pm         | \(\pm\)         |
| mp       | \(\mp\)       | oplus     | \(\oplus\)     | ominus     | \(\ominus\)   |
| otimes   | \(\otimes\)         | oslash    | \(\oslash\)     | odot       | \(\odot\)         |
| bigcirc  | \(\bigcirc\)  | circ      | \(\circ\)     | bullet     | \(\bullet\)         |
| asymp    | \(\asymp\)         | equiv     | \(\equiv\)     | subseteq   | \(\subseteq\) |
| supseteq | \(\supseteq\) | leq       | \(\leq\)     | geq        | \(\geq\)         |
| preceq   | \(\preceq\)         | succeq    | \(\succeq\)     | sim        | \(\sim\)         |
| approx   | \(\approx\)         | subset    | \(\subset\)     | supset     | \(\supset\)         |
| ll       | \(\ll\)         | gg        | \(\gg\)     | prec       | \(\prec\)         |
| succ     | \(\succ\)         | leftarrow | \(\leftarrow\)     | rightarrow | \(\rightarrow\)         |
|          |               |           |           |            |               |

*** Formula

R_sun = 6.96 x 10^8 m.

R_{Alpha Centauri} = 1.28 x R_{sun}

If $a^2=b$ and \( b=2 \), then the solution must be
either $$ a=+\sqrt{2} $$ or \[ a=-\sqrt{2} \].

** Verse

#+BEGIN_VERSE
千山鸟飞绝，万径人踪灭。
孤舟蓑笠翁，独钓寒江雪。
  -- 柳宗元 《江雪》
#+END_VERSE


#+BEGIN_VERSE
The Tao that can be told of
Is not the Absolute Tao;

The Names that can be given
Are not Absolute Names.
  -- 老子
#+END_VERSE
